src/cf/Catalogs/fmItemGroups.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmItemGroups</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ItemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Item</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
								<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/fmBudgetOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IncomesAndExpenses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cashflows</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InternalSettlements</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmItemGroups/Forms/ItemForm/Ext/Form/Module.bsl
#Region ProceduresAndFunctionsOfCommonUse

&AtServer
Procedure RestrictionByTypes() 
	If Object.ItemType = Enums.fmBudgetOperationTypes.Cashflows Then
		TypesArray = New Array;
		TypesArray.Add(Type("CatalogRef.fmCashflowItems"));
		Items.ItemsClosingItems.TypeRestriction = New TypeDescription(TypesArray);
	ElsIf Object.ItemType = Enums.fmBudgetOperationTypes.IncomesAndExpenses Then
		TypesArray = New Array;
		TypesArray.Add(Type("CatalogRef.fmIncomesAndExpensesItems"));
		Items.ItemsClosingItems.TypeRestriction = New TypeDescription(TypesArray);
	EndIf
EndProcedure

#EndRegion

#Region FormItemsEventsHandlers

&AtClient
Procedure BudgetOnChange(Item)
	Object.Items.Clear();
	RestrictionByTypes();
EndProcedure

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	RestrictionByTypes();
EndProcedure

#EndRegion
